In [7]:
import pandas as pd
import numpy as np
obj1 = pd.Series(["a", "b", "c"], index = [10,11,12])
print(obj1)

10    a
11    b
12    c
dtype: object

In [15]:
obj2 = pd.Series({"ID": 1002, "Name": "Hassan Mujtaba", "Father Name": "Kamran"})
print(obj2.index)
print(obj2.values)
print("\n")
print(obj2)
obj2.name = "Student Data"
obj2.index.name = "S.no"
print("\n")
print(obj2)

Index(['ID', 'Name', 'Father Name'], dtype='object')
[1002 'Hassan Mujtaba' 'Kamran']


ID                       1002
Name           Hassan Mujtaba
Father Name            Kamran
dtype: object


S.no
ID                       1002
Name           Hassan Mujtaba
Father Name            Kamran
Name: Student Data, dtype: object

In [35]:
obj1[10] = "h"
print(obj1)
print("\n")

print("h" in obj1)

10    h
11    b
12    c
dtype: object


False

In [23]:
obj3 = pd.Series([0,1,2,3,4,5])
print(obj3 > 1)

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [30]:
print(obj3 * 2)

0     0
1     2
2     4
3     6
4     8
5    10
dtype: int64

In [37]:
frame1 =  pd.DataFrame({
    "day": [1,2,3,4,5,6,7],
    "temperature": [20,30,40,50,17,18,10],
    "windy": [20,30,40,50,17,18,10],
    "rainy": [True, False, True, True, False, True, True]
})
frame1

   day  temperature  windy  rainy
0    1           20     20   True
1    2           30     30  False
2    3           40     40   True
3    4           50     50   True
4    5           17     17  False
5    6           18     18   True
6    7           10     10   True

In [39]:
frame2 = pd.DataFrame([
    {"day": 1, "temp": 16, "rainy": True},
    {"day": 2, "temp": 22, "rainy": False},
    {"day": 3, "temp": 10, "rainy": True}
])
frame2

   day  temp  rainy
0    1    16   True
1    2    22  False
2    3    10   True

In [46]:
frame3 = pd.DataFrame([
    (1,10,33),
    (2,10,33),
    (3,22,44)],
    columns = ['day', 'temp', 'windy'])
frame3

   day  temp  windy
0    1    10     33
1    2    10     33
2    3    22     44

In [49]:
frame4 = pd.read_excel("Book1.xlsx")
frame4

   S.No           Name   F.Name  Roll No.
0     1  Hassan Mujtaba  Kamran     10009

In [50]:
frame5 = pd.read_csv("Book1.csv")
frame5

   S.No           Name   F.Name  Roll No.
0     1  Hassan Mujtaba  Kamran     10009

In [73]:
frame1.to_excel("weather.xlsx", sheet_name = "weather")
frame1

   day  temperature  windy  rainy
0    1           20     20   True
1    2           30     30  False
2    3           40     40   True
3    4           50     50   True
4    5           17     17  False
5    6           18     18   True
6    7           10     10   True

In [54]:
frame4 = pd.read_excel("Book1.xlsx")
frame4["Roll No."]

0    10009
Name: Roll No., dtype: int64

In [60]:
frame4 = pd.read_excel("Book1.xlsx")
frame4[["F.Name","Roll No."]]

   F.Name  Roll No.
0  Kamran     10009
1    Noor      1111
2   Naeem     11222
3   Naeem     11223
4   Naeem     11224
5   Naeem     11225
6   Naeem     11226

In [63]:
frame4.head(3)

   S.No           Name   F.Name  Roll No.
0     1  Hassan Mujtaba  Kamran     10009
1     2             Ali    Noor      1111
2     3       Mustaqeem   Naeem     11222

In [66]:
frame4.tail(4)

   S.No      Name  F.Name  Roll No.
3     4  Mustaqeem  Naeem     11223
4     5  Mustaqeem  Naeem     11224
5     6  Mustaqeem  Naeem     11225
6     7  Mustaqeem  Naeem     11226

In [67]:
frame4.columns

Index(['S.No', 'Name ', 'F.Name', 'Roll No.'], dtype='object')

In [77]:
frame4["Roll No."].max()

11226

In [78]:
frame4["Roll No."].min()

1111

In [79]:
frame4["Roll No."].mean()

9605.714285714286

In [80]:
frame4.describe()

           S.No      Roll No.
count  7.000000      7.000000
mean   4.000000   9605.714286
std    2.160247   3773.085904
min    1.000000   1111.000000
25%    2.500000  10615.500000
50%    4.000000  11223.000000
75%    5.500000  11224.500000
max    7.000000  11226.000000

In [81]:
frame4.loc[2]

S.No                3
Name        Mustaqeem
F.Name          Naeem
Roll No.        11222
Name: 2, dtype: object

In [4]:
frame4[["F.Name","Roll No."]][frame4["S.No"] == 3]

NameError: name 'frame4' is not defined